{"Charaters/Barbarian":{"title":"Barbarian","links":["Maps/Barresh-Settlements","Maps/Castle-Fortaan"],"tags":[],"content":"\n\n                  \n                  Lore \n                  \n                \n\nThe Barbarian comes from a settlement in the Barresh Mountains covered in rugged terrain North of Castle Fortaan.  He began to travel to other lands, but when he returned, he discovered that his village had been taken over by monsters.  Vowing to free his people, he is joined by 7 other heroes on his quest to stop evil.\n\n\n\n\n\n\n\n\n\nWeapon:Axe: Defeat all adjacent monsters and move 1 space."},"Charaters/Druid":{"title":"Druid","links":["Monsters/Dark-Druid"],"tags":[],"content":"\n\n                  \n                  Lore \n                  \n                \n\nThe Druid comes from a line of ancient beings known as “Druids,” who lived in an ancient temple in Waldurk Forest. When the Dark Druid took over, this Druid was the only one who remained in the forest, where he meditated for long days.  Learning the ways of nature, he became able to heal himself from any wound.\n\n\n\n\n\n\n\n\n\nWeapon:Staff: Restore full health."},"Charaters/Knight":{"title":"Knight","links":["Maps/Castle-Fortaan","Charaters/Sage"],"tags":[],"content":"\n\n                  \n                  Lore \n                  \n                \n\nThe Knight, a noble and skilled servant of the King, was not defeated along with the rest of the army by the Goblins, he was posted far away from the castle during the invasion.  He is determined to help rescue the King as as he could not do before, and he invades Castle Fortaan while the Sage guides the Prince to safety.\n\n\n\n\n\n\n\n\n\nWeapon:Sword: Move up to 2 spaces and defeat an adjacent monster."},"Charaters/Prince":{"title":"Prince","links":["Maps/Castle-Fortaan","Charaters/Sage","Charaters/Wizard"],"tags":[],"content":"\n\n                  \n                  Lore \n                  \n                \n\nThe Prince is a young swordsman from Castle Fortaan, son of the King and mentored by the Sage.  The grief of losing his father nearly drove him mad, but when the Wizard came with the intention of rescuing the King, the Sage unable to persuade him to stay in safety.  From the urge to regain his father to the excitement of adventure, the young Prince is perhaps the most steadfast and determined of all the heroes.\n\n\n\n\n\n\n\n\n\nWeapon:Sword: Move up to 2 spaces and defeat an adjacent monster."},"Charaters/Ranger":{"title":"Ranger","links":["Maps/Seldaan-Village"],"tags":[],"content":"\n\n                  \n                  Lore \n                  \n                \n\nThe Ranger lives in Seldaan Village, where he and a small group of other heroes are spearheading a plan to defend their home from evil.  To this point, they have successfully supplied themselves with food as well as created an ever-small but ever-growing army to fight the monster armies.\n\n\n\n\n\n\n\n\n\nWeapon:Bow: Defeat a monster up to 5 spaces away in a straight line."},"Charaters/Sage":{"title":"Sage","links":["Maps/Castle-Fortaan","Charaters/Prince","Charaters/Druid","Charaters/Wizard"],"tags":[],"content":"\n\n                  \n                  Lore \n                  \n                \n\nThe Sage is from the Kingdom of Ennon, and he lived in Castle Fortaan as the King’s Advisor for many years.  When the castle was invaded and the King captured, he took it upon himself to mentor and protect the Prince.  This ancient man takes up a different form of magic than the Druid or the Wizard, and because his magic does not affect the living, he has no need for any object with which concentrate his magic; he needs only to read the spell from his book.\n\n\n\n\n\n\n\n\n\nWeapon:Book: Pick up one item up to 4 spaces away without moving your hero."},"Charaters/Thief":{"title":"Thief","links":["Maps/Drandora-Port","Maps/Caverns-of-Nathuz","Monsters/Golems/Golem-Lord"],"tags":[],"content":"\n\n                  \n                  Lore \n                  \n                \n\nThe Thief originates from Drandora, the last free city in the world surrounding Ennon.  He was born homeless, and he stole to survive.  With the arising evil, the Thief wishes to use his survival skills to prove to himself that he can do good, so he ventures into the Caverns of Nathuz to defeat the dreaded Golem Lord.\n\n\n\n\n\n\n\n\n\nWeapon:Dagger: Defeat the monster and take 1 gold piece from the store."},"Charaters/Wizard":{"title":"Wizard","links":["Maps/Ilrion"],"tags":[],"content":"\n\n                  \n                  Lore \n                  \n                \n\nThe Wizard comes from a mystical city where he spent his life studying. Here he developed uncanny magical powers, allowing him to generate pure energy from aether. The city’s location is unknown, but it is rumoured to be far to the West of the Ilrion.\n\n\n\n\n\n\n\n\n\nWeapon:Wand: Defeat an enemy up to 4 spaces away, even around corners."},"Heroica-Unlimited":{"title":"Heroica Unlimited","links":["Maps/Waldurk-Cavern"],"tags":[],"content":"Heroica Unlimited is an expansion on Heroica adding new maps, enemies and rules to the game.\nRule Changes\nProgression\nThis game can be pla\nMaps\nWaldurk Cavern"},"Items-and-Obstacles/Coffins":{"title":"Coffins","links":[],"tags":[],"content":"\n\n\n\n\n\n\nIf you move into a space with a coffin, you MUST end your move standing on it and immediatly search it. Roll the LEGO Dice again to find out what happens.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPut the coffin back in the box AND take 1 gold from the store.Lose 1 Health AND move back 1 space. THEN put a vampire bat on the coffin and fight it immediately.Put the coffin back in the box.Lose 1 health AND move back 1 space away from the coffin."},"Items-and-Obstacles/Locked-Doors":{"title":"Locked Doors","links":[],"tags":[],"content":"\n\n\n\n\n\n\nYou may not move through Locked Doors. If you move into or through a space adjacent to a Locked Door, you may put a Key from your Hero Pack into the top to unlock it. After a Door is unlocked, any player may move through it to the spaces on either side. Each key may only be used once, and you may only carry ONE key at a time.If you are in a space adjacent to a Locked Door and roll “Shield” at the start of your turn, you may pass through the Door to the first available space on the other side, instead of moving. The Door remains locked."},"Items-and-Obstacles/Magic-Buttons-and-Doors":{"title":"Magic Buttons and Doors","links":[],"tags":[],"content":"\n\n\n\n\n\n\nYou may not move through Magic Doors. If you end you move on a Magic Space, you may move one Magic Door to any empty dark gray space. If you are in a space adjacent to a magic Door and roll “shield” at the start of your turn, you may pass through the Door to the first available space on the other side, instead of moving."},"Items-and-Obstacles/Potions":{"title":"Potions","links":[],"tags":[],"content":"You may use a Potion at any time during your turn, but each Potion may only be used once. After you use a Potion, put it back in the box.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLife:Restore 2 HealthLuck:Re-roll the LEGO DiceSpeed:Move up to 4 extra spacesStrength:Defeat an adjacent monsterDefense:Prevent any loss of health this turn"},"Items-and-Obstacles/Relics":{"title":"Relics","links":[],"tags":[],"content":"A relic is an item that can be sold to the Store for two gold or can be used to help a hero\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCrystal of Deflection:Bring you back with one health when you are defeatedScepter of Summoning:None of the hero’s understand how to use itFang of fury:You may choose to use the fang as a melee skill to defeat the monster and gain 1 health. You cannot use this to gain more than your full healthBlades of Bounty:You may choose to use the Blades as a melee skill. You defeat the monster and roll again. If you roll “Sword” take 1 gold from the store. If you roll “Shield” take 2 gold from the store. If you roll “Sword &amp; Skull” or “Skull” nothing happensChalice of Life:This relic will restore up to two health. It can only be used once.Helmet of ProtectionThis relic adds one to your overall health."},"Items-and-Obstacles/Rocks":{"title":"Rocks","links":[],"tags":[],"content":"\n\n\n\n\n\n\nYou may not move through rocks. If you move into a space adjacent to rocks, you MUST end you move in that space and explore them. Roll the LEGO Dice again to find out what happens.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPass through the rocks to the first available space on the other side.Move back 1 space away from the rocks.Remove the rocks and put them back in the box.Move back 1 space away from the rocks."},"Items-and-Obstacles/Torches":{"title":"Torches","links":[],"tags":[],"content":"\n\n\n\n\n\n\nIf you are carrying a torch, you may move 1 extra space on each turn. You may only carry ONE torch at a time.If you lose any Health, you drop your torch and it goes out. Put the torch back in the box."},"Items-and-Obstacles/Treasure-Chests":{"title":"Treasure Chests","links":[],"tags":[],"content":"\n\n\n\n\n\n\nIf you move into a space with a Treasure Chest, you MUST end your move in that space and search it. Roll the LEGO Dice again to find out what happens. Then put the Treasure Chest back in the box. Treasure Chests contain gold or traps. If you find gold, take it from the store.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFind 2 gold pieces.Lose 1 Health.Find 1 gold piece.Find 1 gold piece and lose 1 Health."},"Items-and-Obstacles/Weapons-and-Gold":{"title":"Weapons and Gold","links":[],"tags":[],"content":"On your turn you may buy weapons from the store for 3 gold each and sell weapons back to the store for 2 gold each. Every weapon gives you an alternative skill that you may use if you roll a Shield. You may carry more than one weapon, but may not use more than one skill at a time.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAxe:(Melee) Defeat ALL adjacent monsters.Wand:(Ranged) Defeat a monster up to 3 spaces away, even around corners.Staff:(Ranged) Restore up to 2 healthBow:(Ranged) Defeat a monster up to 5 spaces away in a straight lineDagger:(Melee) Defeat the monster and take 1 gold peice from the storeSword:(Melee) Move 1 space and defeat an adjacent monster"},"Maps/Barresh-Settlements":{"title":"Barresh Settlements","links":[],"tags":[],"content":"The barbarians are proud descendants of an old line of warriors, who have made the mountains their home. This rugged terrain is a harsh environment for even the toughest of warriors. For these wild sons of warriors each day is a constant fight for survival. Forming small scattered settlements, they band together to overcome the surroundings. Now facing a common enemy, they honor a code of solidarity and fight evil together."},"Maps/Castle-Fortaan":{"title":"Castle Fortaan","links":["Monsters/Goblins/Goblin-King"],"tags":[],"content":"\n\nWhen the Kingdom of Ennon fell, The Goblin King claimed the castle as the strongest possible fortress for himself and his Goblin Army. The once so magnificent home of noble kings, queens and knights now echoes with the howls and growls of dark monsters. The whereabouts of the true king is still unknown."},"Maps/Caverns-of-Nathuz":{"title":"Caverns of Nathuz","links":["Maps/Draida-Bay","Maps/Barresh-Settlements","Monsters/Golems/Golem-Lord","Monsters/Beasts/Bat"],"tags":[],"content":"\n\nThese mystical caverns stretch deep into the belly of the dark mountains of Nathuz. The web of secret pathways once served as a passageway for smugglers between Draida Bay and the Barresh Settlements.\nNow the Golem Lord is raising his army here. And the Giant Bats that have lived in the darkest corners of the caves for aeons have woken from their slumber to wreak havoc on the land."},"Maps/Draida-Bay":{"title":"Draida Bay","links":["Monsters/Goblins/Goblin-General"],"tags":[],"content":"\n\nDraida Bay is controlled by the merciless Goblin General. Most traffic that passes in or out of the kingdom has to cross through this port. The bay is named after the Queen Draida who lost her young son here centuries ago. The legend says she went mad with grief. She convinced a wizard to turn her into a sea creature so she could find her son and bring him back to life. The wizard warned her, if she did not find him, she would remain a sea creature for all eternity. She never returned."},"Maps/Drandora-Port":{"title":"Drandora Port","links":["Charaters/Thief"],"tags":[],"content":"Drandora Port is the Thief’s old stomping grounds. Once, the differences here between rich and poor were evident, but now the people of the city are coming together to defend the bastion of their world. Will they be able to stand united, or will some fall for the temptation of becoming spies for the dark armies to save their lives?"},"Maps/Gates-of-Elsruck":{"title":"Gates of Elsruck","links":[],"tags":[],"content":"This ancient powerful gate is the primary defence for the kingdom of Ennon. It guards a mountain passage that leads to the neighboring lands. The gates were built by the original founders of Ennon but their names have long been lost to the pages of history."},"Maps/Ilrion":{"title":"Ilrion","links":["Monsters/Goblins/Goblin-General","Maps/Draida-Bay","Monsters/Beasts/Bat","Monsters/Zombie","Monsters/Vampire-Lord"],"tags":[],"content":"\n\nSince the dark forces settled upon the land, farmers have struggled to maintain their livelihood. Monsters constantly ravage the fields and destroy most of the crops, and what is left is barely enough for families to survive. There is no longer enough to trade, and even if there was, the Goblin General’s siege on Draida Bay makes it impossible to sell or buy anything. Prospects are grim.\nIt’s up to you to locate the Catacombs, fight your way past vicious bats and lumbering Zombies, and defeat the Vampire Lord to rescue the King!"},"Maps/Seldaan-Village":{"title":"Seldaan Village","links":[],"tags":[],"content":"Seldaan Village is struggling like every other corner of the kingdom. However, secret alliances of heroes are emerging in the village, where they meet in secret locations to plan everything from smuggling messages and goods in and out of the area, to raising an army to fight evil."},"Maps/Waldurk-Cavern":{"title":"Waldurk Cavern","links":["Maps/Draida-Bay","Maps/Waldurk-Forest","Monsters/Beasts/Spider"],"tags":[],"content":"(Heroica Unlimited Expansion)\nThis Cavern stretches from the Bay to Waldurk Forest is one of the main entrances to the Waldurk Forest. But now it is overrun with Spiders, and has grown to dangerous to travel\n\nThis map will connect to Waldurk Forest and Draida Bay."},"Maps/Waldurk-Forest":{"title":"Waldurk Forest","links":["Monsters/Dark-Druid","Monsters/Beasts/Werewolf","Monsters/Beasts/Spider"],"tags":[],"content":"\n\nThe oldest trees in the forest are more than 1,000 years old. Many years ago, the Druids lived here in an ancient temple. Shrouded in mystery, they passed on their wisdom from generation to generation. One druid was corrupted by power, and turned into a force of evil. The temple has now decayed into ruins where the Dark Druid and his secrets are guarded by fierce werewolves. Most animals fled along with the Druids. Other creatures, like the giant spiders, are falling under the spell of the dark forces."},"Monsters/Beasts/Bat":{"title":"Bat","links":[],"tags":[],"content":"\n\n                  \n                  Lore \n                  \n                \n\nThere had been legends and tales of enormous Bats living deep within the Caverns of Nathuz, but until the invasion of the monsters none had ever seen such beasts. But now with the arrival of the Golems, the Bats have started to pour out of the caves at night to plague the neighboring countryside.\nUnlike normal harmless bats, these giant Bats aren’t very peaceful\n\n\n\n\n\n\n\n\n\nStrength: 1"},"Monsters/Beasts/Giant-Vampire-Bat":{"title":"Giant Vampire Bat","links":[],"tags":[],"content":"\n\n\n\n\n\n\nThe Giant Vampire Bat starts with 4 strength on its monster bar. It is defeated when ALL its strength is removed.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRemove 1 strength from the monster bar, THEN roll again and keep fighting.Lose health equal to the giant monster’s CURRENT strength AND move back 1 space.Remove 1 strength from the monster bar, THEN roll again and keep fighting.First remove 1 strength from the monster bar, THEN lose health equal to the giant monster’s CURRENT strenght AND move back 1 space."},"Monsters/Beasts/Spider":{"title":"Spider","links":[],"tags":[],"content":"\n\n                  \n                  Lore \n                  \n                \n\nThe giant Spiders of Waldurk Forest had always been scary too look upon but had not troubled travelers or villagers before. Now that the monsters have infested the land, the Spiders have grown aggressive and pose a dangerous threat to anyone who dares enter the forest.\n\n\n\n\n\n\n\n\n\nStrength: 1"},"Monsters/Beasts/Werewolf":{"title":"Werewolf","links":[],"tags":[],"content":"\n\n                  \n                  Lore \n                  \n                \n\nPulled through the rift by the Dark Druid, the fierce Werewolves are completely bound to his will. They act as bodyguards and will defend their master till the bitter end. Their claws and fangs can easily shred through armor and the Werewolves will attack at the slightest provocation.\n\n\n\n\n\n\n\n\n\nStrength: 2"},"Monsters/Dark-Druid":{"title":"Dark Druid","links":[],"tags":[],"content":"\n\n                  \n                  Lore \n                  \n                \n\nThe Dark Druid is an evil wielder of magic. He has claimed the ruins of Waldurk Forest as his lair, and is haunting the neighboring villages. His knowledge of the dark arts is vast and only the bravest of heroes will stand a chance of defeating him.\n\n\n\n\n\n\n\n\n\nStrength: 3"},"Monsters/Goblins/Goblin-General":{"title":"Goblin General","links":[],"tags":[],"content":"\n\n                  \n                  Lore \n                  \n                \n\nThe Goblin King’s fiercest warrior, the Goblin General holds his position through brute strength. Wherever the Goblin General leads his forces, they are sure to be victorious. His latest mission is to guard the vulnerable Draida Bay to cut off incoming supplies and stop any attempt to free the port.\n\n\n\n\n\n\n\n\n\nStrength: 3"},"Monsters/Goblins/Goblin-Guardians":{"title":"Goblin Guardians","links":[],"tags":[],"content":"\n\n                  \n                  Lore \n                  \n                \n\nThe Goblin Guardians are hand-picked by the Goblin King to serve as special troops. Not only used to watch over treasures and secure key positions on the battlefield, they also make up the Goblin King’s personal guard. Guardians have proven themselves in battle and are tough opponents.\n\n\n\n\n\n\n\n\n\nStrength: 2"},"Monsters/Goblins/Goblin-King":{"title":"Goblin King","links":[],"tags":[],"content":"\n\n                  \n                  Lore \n                  \n                \n\nThe Goblin King is the ruler of all the goblins. He rose to power by being the meanest and the toughest of them all. Once again released through the rift, the Goblin King now rules over the kingdom of Ennon from Castle Fortaan with an iron fist having crushed anyone who dared to oppose him.\n\n\n\n\n\n\n\n\n\nStrength: 3"},"Monsters/Goblins/Goblin-Warriors":{"title":"Goblin Warriors","links":[],"tags":[],"content":"\n\n                  \n                  Lore \n                  \n                \n\nVicious and sneaky, the Goblin Warriors make up the majority of the Goblin army. What they lack in strength they make up in numbers. Wherever you see one there are sure to be more around, waiting to ambush unsuspecting victims. They are cowardly however and prefer to attack if they outnumber their foes.\n\n\n\n\n\n\n\n\n\nStrength: 1"},"Monsters/Goblins/index":{"title":" Goblins","links":[],"tags":[],"content":"The Goblins are the most numerous of all the threatening evil in Ennon, holding about 3 out of and 7 soldiers in the kingdom and surrounding areas to this point.  The average Goblin may be weak, but they are lead by two horrific monsters, the Goblin King and his Goblin General.  Besides having completely conquered and inhabited Castle Fortaan, they now control Draida Bay, Ennon’s only sea port, blocking off nearly all help from Drandora."},"Monsters/Golems/Golem-Guardian":{"title":"Golem Guardian","links":[],"tags":[],"content":"\n\n                  \n                  Lore \n                  \n                \n\nThe Golem Guardians are summoned minions of the Golem Lord. Reflecting the strength of their master, Golem Guardians are a challenging foe. There are still only a few of them but they are growing in number as the Golem Lord continues to build his army.\n\n\n\n\n\n\n\n\n\nStrength: 2"},"Monsters/Golems/Golem-Lord":{"title":"Golem Lord","links":[],"tags":[],"content":"\n\n                  \n                  Lore \n                  \n                \n\nThe Golem Lord was created by ancient magic long ago and gains his power from the living jewel imbedded in his chest. He now stalks the dark Caverns of Nathuz furthering his evil schemes. Many times stronger than any mortal man, a blow from him is enough to fell even the mightiest of heroes.\n\n\n\n\n\n\n\n\n\nStrength: 3"},"Monsters/Golems/index":{"title":"Golems","links":[],"tags":[],"content":"Golems are creatures either resembling rock or literally made of rock.  These monsters live deep within the Caverns of Nathuz, where their small numbers are constantly growing."},"Monsters/Vampire-Lord":{"title":"Vampire Lord","links":[],"tags":[],"content":"\n\n                  \n                  Lore \n                  \n                \n\nDeep down under the mountain, hidden in the Ilrion Catacombs, the dreaded Vampire Lord sits on his sumptuous throne. In his underground prison he holds captive the King of Ennon. It is said that like a flash the Vampire Lord is able to disappear in a cloud of smoke - only to reappear out of thin air and attack by surprise. Legends also tell of strange sightings of a giant, bat-shaped shadow seen passing over IIrion on brightly moonlit nights.\n\n\n\n\n\n\n\n\n\nStrength: 3"},"Monsters/Zombie":{"title":"Zombie","links":[],"tags":[],"content":"\n\n                  \n                  Lore \n                  \n                \n\nZombies are stumbling, ponderous Monsters, aimlessly roaming around the extensive catacomb systems beneath Ilrion. Stupid as they are, Zombies make perfect henchmen for a brilliant mind like the Vampire Lord. The fact they feel no pain also makes Zombies fierce warriors which hit hard and will never retreat.\n\n\n\n\n\n\n\n\n\nStrength: 2"},"Original-Rulebook":{"title":"Original Rulebook","links":["Charaters/Barbarian","Charaters/Thief","Charaters/Ranger","Charaters/Knight","Charaters/Prince","Charaters/Wizard","Charaters/Druid","Charaters/Sage","Monsters/Goblins/Goblin-Warriors","Monsters/Goblins/Goblin-Guardians","Monsters/Goblins/Goblin-General","Monsters/Goblins/Goblin-King","Monsters/Golems/Golem-Guardian","Monsters/Golems/Golem-Lord","Monsters/Beasts/Bat","Monsters/Beasts/Spider","Monsters/Beasts/Werewolf","Monsters/Dark-Druid","Monsters/Zombie","Monsters/Vampire-Lord","Items-and-Obstacles/Potions","Items-and-Obstacles/Treasure-Chests","Items-and-Obstacles/Rocks","Items-and-Obstacles/Magic-Buttons-and-Doors","Items-and-Obstacles/Locked-Doors","Items-and-Obstacles/Coffins","Items-and-Obstacles/Torches","Items-and-Obstacles/Weapons-and-Gold","Heroica-Unlimited","Items-and-Obstacles/Relics"],"tags":[],"content":"Playing the game\nThe youngest player goes first.  Play then continues clockwise.\nMoving Heroes\nOn your turn roll the LEGO Dice and move your Hero up to the number of spaces rolled.\nHeroica Shield = Move up to 4 spaces OR use your Hero’s Ranged skill.\nThree = Move up to 3 spaces.\nTwo = Move up to 2 spaces.\nOne = Move 1 space.\n\nIf you end your move in a space occupied by another Hero, move your Hero forward to the first available space.\nPick up and items in spaces you move into or through and put them in your Hero Pack.\nIf you move into a space adjacent to a monster, you MUST end your move in that space and fight the monster.\n\nYou may not move diagonally.\nFighting monsters\nIf you fight a monster, roll the LEGO Dice again to find out what happens.\nHeroica Shield = Defeat a monster OR use your Hero’s Melee skill.\nSword = Defeat the monster.\nSkull = Lose Health equal to the monster’s strength AND move back 1 space away from the monster.\nSword &amp; Skull = Defeat monster AND lose Health equal to the monster’s strength AND move back 1 space away from the monster.\n\nIf you defeat the monster, take it off the board and put it on your Hero Pack.\nIf you are adjacent to two or more monsters at the same time, choose which one to fight first.  If you win, immediately fight the next monster.\n\nYou may not fight diagonally.\nHeroes\nYour Hero has a special Ranged or Melee skill that you may use if you roll a “Shield”.\nBarbarian, Thief, Ranger, Knight, Prince, Wizard, Druid, Sage\nMonsters\nMonsters have different strengths.\nGoblins: Goblin Warriors, Goblin Guardians, Goblin General, Goblin King\nGolems: Golem Guardian, Golem Lord\nBeasts: Bat, Spider, Werewolf, Vampire Bat\nDark Druid, Zombie, Vampire Lord\nHealth\nIf you lose all your Health, you are temporarily defeated and must spend one or more turns healing.  On your turn, roll the LEGO Dice and restore Health up to the number you rolled.  If you roll “Shield”, restore your full Health.  Roll once on each turn until you have restored your full Health.  Then roll and move your Hero on your next turn.\nYou may not heal in this way unless you have lost ALL your Health.\nItems and Obstacles\nPotions\nTreasure Chests, Rocks, Magic Buttons and Doors, Locked Doors, Coffins\nTorches\nWeapons and Gold\nWinning the Game\nThe first player to move into the target space shown on the Mission Map or defeat the monster on that space wins the game.\nKeep items and defeated monsters on your Hero Pack.\nGame Variations\nTry building your own missions, thinking up exciting stories about the adventures of your Heroes, or even changing the rules!  The secret to changing a game is to only change one thing at a time.  Collect and combine Heroica sets to build bigger and more detailed missions ---with more Heroes to play, more monsters to fight, and more of the amazing world of Heroica to explore!\nEpic Heroica\nIn Epic Heroica, play two or more missions one after another.  The player who wins the most missions wins the game.  If two or more players are tied, the player with the most gold at the end of the game wins.\n\n\nAt the start of each mission, restore your full Health.\n\n\nAt the end of each mission, if you have the most defeated monsters on your Hero Pack, take 1 gold piece from the store.  Keep any gold, Potions and weapons on your Hero Pack for the next mission.  Put all monsters and other items back in the box ready for the next mission.\n\n\nChalice of Life; Crystal of Deflection; Scepter of Summoning; Helmet of Protection; Fang of Fury - See Relics\nBattle Heroica\nIn Battle Heroica one player controls all the monsters.  Players take turns as usual, but the Monster Player must play last.  The Monster Player wins the game by defeating two Heroes, or defeating the same Hero twice.\nIf you are the Monster Player, on your turn choose on of the monsters to move, then roll the LEGO Dice and move the monster up to the number of spaces rolled.\n\nIf you roll “Shield”, move up to 4 spaces OR pass through an adjacent Magic Door.\nYou may not pick up items.  If you end your move in a space occupied by another monster or and item, move your monster forward to the first available space.\nIf you move into a space adjacent to a Hero, you MUST end your move in that space and fight the Hero.\n\nYou may not fight a defeated Hero who is healing.\n\nShield = Hero loses ONE MORE Health than the strength of your monster AND Hero moves back 1 space away from your monster.\nSword = Hero loses Health equal to the strength of your monster AND Hero moves back 1 space away from your monster.\nSkull = Your monster is defeated.\nSword &amp; Skull = Hero loses Health equal to the strength of your monster AND Hero moves back 1 space away from your monster AND your monster is defeated.\n"},"index":{"title":" Welcome to the Heroica Wiki","links":["Original-Rulebook","New-Rulebook"],"tags":[],"content":"Here you can find access to the Original Rulebook, a New Rulebook, and information on everything in the game."}}