[
  "obsidian-excalidraw-plugin",
  "fantasy-content-generator",
  "obsidian-leaflet-plugin",
  "storyclock",
  "obsidian-icon-folder",
  "obsidian-admonition",
  "omnisearch",
  "editing-toolbar",
  "highlightr-plugin",
  "obsidian-style-settings"
]